In [89]:
import pandas as pd
df = pd.read_csv("Scat_number_970.csv")
df.head()

   Location       Date  Time  Vehicle Count
0         1  10/1/2006  0:00             86
1         3  10/1/2006  0:00             37
2         5  10/1/2006  0:00             92
3         7  10/1/2006  0:00             47
4         1  10/2/2006  0:00             32

In [90]:
X = df[['Location', 'Date', 'Time']]
y = df['Vehicle Count']

In [91]:
X

       Location        Date   Time
0             1   10/1/2006   0:00
1             3   10/1/2006   0:00
2             5   10/1/2006   0:00
3             7   10/1/2006   0:00
4             1   10/2/2006   0:00
...         ...         ...    ...
11803         7  10/30/2006  23:45
11804         1  10/31/2006  23:45
11805         3  10/31/2006  23:45
11806         5  10/31/2006  23:45
11807         7  10/31/2006  23:45

[11808 rows x 3 columns]

In [92]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2, random_state=10)

In [93]:
X_train

       Location        Date   Time
556           3  10/17/2006   1:00
6074          1  10/13/2006  12:15
6086          1  10/16/2006  12:15
8537          7  10/13/2006  17:15
520           3   10/8/2006   1:00
...         ...         ...    ...
7291          7   10/9/2006  14:45
11633         1  10/19/2006  23:30
1344          7  10/29/2006   2:30
7293          3  10/10/2006  14:45
1289          1  10/16/2006   2:30

[9446 rows x 3 columns]

In [107]:
train_data = pd.concat([X_train, y_train], axis=1)
test_data = pd.concat([X_test, y_test], axis=1)

train_data.to_csv('Scat_number_970_train.csv', index=False)
test_data.to_csv('Scat_number_970_test.csv', index=False)